{
  "Version": "1.3",
  "ID": "f1b32bv4ewul67vibile2f5tmrvohgks6oaqhilci",
  "Issue Number": "36",
  "Client": {
    "Name": "XYY",
    "Region": "China",
    "Industry": "Arts & Recreation",
    "Website": "https://filecoinproject.slack.com/team/U07JW39MLG0",
    "Social Media": "1411479497@qq.com",
    "Social Media Type": "Other",
    "Role": "Data Preparer"
  },
  "Project": {
    "Brief history of your project and organization": "Since its establishment, our company has focused on providing high-quality entertainment video content, covering multiple fields, including travel, sports, lifestyle, etc. We are committed to providing high-quality leisure videos to users around the world, making these contents more accessible through innovative technologies and platforms. This application for DataCap is to store our leisure video content on the Filecoin network to ensure the security and long-term accessibility of the data.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "This dataset contains various types of leisure video content, covering entertainment, travel, sports, lifestyle and other fields. The video format is high-definition, compressed and processed for streaming and downloading. The data will be stored in the Filecoin network to ensure its durability, security and easy access to users around the world.",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "The data will be compressed, converted and standardized locally using tools such as FFmpeg to ensure that all videos meet storage and transmission requirements. Use the graphsplit program to create a .car file that complies with the rules,Then use the venus tool for packaging",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://pan.baidu.com/s/1qftM0F6yhixQ1h8oze8whw?pwd=2tgb",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[ ] I confirm",
    "What is the expected retrieval frequency for this data": "Daily",
    "For how long do you plan to keep this dataset stored on Filecoin": "More than 3 years",
    "In which geographies do you plan on making storage deals": "Asia other than Greater China, North America",
    "How will you be distributing your data to storage providers": "Shipping hard drives, Venus built-in data transfer, Cloud storage (i.e. S3)",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "DE：f03298672, f03298673\nUK：f03308933\nJP：f03308920 f03308922",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "1.5PiB",
    "Single Size Dataset": "500TiB",
    "Replicas": 4,
    "Weekly Allocation": "1000TiB"
  },
  "Lifecycle": {
    "State": "Submitted",
    "Validated At": "",
    "Validated By": "",
    "Active": true,
    "Updated At": "2025-01-18 08:04:07.156050074 UTC",
    "Active Request ID": "",
    "On Chain Address": "f1b32bv4ewul67vibile2f5tmrvohgks6oaqhilci",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": []
}