{
  "Version": "1.3",
  "ID": "f1offau5lwhthzahd5timsc5r4rpyon3xlgo5yarq",
  "Issue Number": "26",
  "Client": {
    "Name": "Feige Technology",
    "Region": "China",
    "Industry": "IT & Technology Services",
    "Website": "https://fileguard.io",
    "Social Media": "N/A",
    "Social Media Type": "Slack",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Brief history of your project and organization": "As a pioneer in AI data services, Feige has been dedicated to providing comprehensive data solutions for algorithm enterprises since 2018. We have integrated a unified service system of software and hardware, covering the full-process services including data collection, verification, cleaning, desensitization, annotation, storage, and transmission. With professional technical capabilities and premium service quality, Feige has successfully served over 30 AI enterprise clients, including industry leaders such as MEGVII (Face++), SenseTime, and JD Finance. To date, we have provided more than 20 million annotated image data sets, with approximately 200,000 professional crowd-workers collaborating on our platform.\r\n\r\nAs a deep participant in the Web3 ecosystem, Feige is actively advancing the storage deployment of machine learning and deep learning datasets on the Filecoin network. We focus on three core areas of artificial intelligence: Computer Vision (CV), Natural Language Processing (NLP), and Speech Processing. We firmly believe that storing high-value datasets through Web3 technology - including autonomous driving, cancer research, disease diagnosis, geographic information, agricultural production, speech recognition, and natural language processing - will bring revolutionary changes to the industry.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "This application including 4 AWS open dataset focus on labeled video:\r\n\r\n1. PersonPath22\r\nLINK: https://registry.opendata.aws/person-path-22/\r\nPersonPath22 is a large-scale multi-person tracking dataset containing 236 videos captured mostly from static-mounted cameras, collected from sources where we were given the rights to redistribute the content and participants have given explicit consent. Each video has ground-truth annotations including both bounding boxes and tracklet-ids for all the persons in each frame.\r\n\r\n2. YouTube 8 Million - Data Lakehouse Ready\r\nLINK: https://registry.opendata.aws/yt8m/\r\nThis both the original .tfrecords and a Parquet representation of the YouTube 8 Million dataset. YouTube-8M is a large-scale labeled video dataset that consists of millions of YouTube video IDs, with high-quality machine-generated annotations from a diverse vocabulary of 3,800+ visual entities.\r\n\r\n3. Multimedia Commons\r\nLINK: https://registry.opendata.aws/multimedia-commons/\r\nThe Multimedia Commons is a collection of audio and visual features computed for the nearly 100 million Creative Commons-licensed Flickr images and videos in the YFCC100M dataset from Yahoo! Labs, along with ground-truth annotations for selected subsets.\r\n\r\n4. Multiview Extended Video with Activities (MEVA)\r\nLINK: https://registry.opendata.aws/mevadata/\r\nThe Multiview Extended Video with Activities (MEVA) dataset consists video data of human activity, both scripted and unscripted, collected with roughly 100 actors over several weeks.",
    "Where was the data currently stored in this dataset sourced from": "AWS Cloud",
    "How do you plan to prepare the dataset": "No response",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "s3://mevadata-public-01/\r\ns3://multimedia-commons/\r\ns3://aws-roda-ml-datalake/yt8m/\r\ns3://tracking-dataset-eccv-2022",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Monthly",
    "For how long do you plan to keep this dataset stored on Filecoin": "More than 3 years",
    "In which geographies do you plan on making storage deals": "Greater China",
    "How will you be distributing your data to storage providers": "Cloud storage (i.e. S3), HTTP or FTP server",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "1. f01824405, CN\r\n2. f0685706,  HK\r\n3. f01828146, HK\r\n4. f03179570, SP\r\n5. f03229933, KR",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "800TiB",
    "Single Size Dataset": "200TiB",
    "Replicas": 4,
    "Weekly Allocation": "400 TiB"
  },
  "Lifecycle": {
    "State": "ReadyToSign",
    "Validated At": "2025-01-07 09:31:22.701155763 UTC",
    "Validated By": "maxvint",
    "Active": true,
    "Updated At": "2025-01-07 09:31:22.701160259 UTC",
    "Active Request ID": "5b1365a8-792d-42e0-af8c-302eef39477e",
    "On Chain Address": "f1offau5lwhthzahd5timsc5r4rpyon3xlgo5yarq",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": [
    {
      "ID": "408145df-9d8a-4607-904f-3ba9e5e24303",
      "Request Type": "First",
      "Created At": "2024-12-29 13:45:12.710602442 UTC",
      "Updated At": "2024-12-29 13:45:12.710603431 UTC",
      "Active": false,
      "Allocation Amount": "80TiB",
      "Signers": [
        {
          "Github Username": "maxvint",
          "Signing Address": "f1bv4fwfmiuww25jhwqvtjsjofxu77iyhqac4j6qy",
          "Created At": "2024-12-29 13:48:03.026000000 UTC",
          "Message CID": "bafy2bzacebasozcsjscw33y6rho7ksdhhwg4z6dyargqw2nsdqmkyw4kgyqui"
        }
      ]
    },
    {
      "ID": "5b1365a8-792d-42e0-af8c-302eef39477e",
      "Request Type": "Refill",
      "Created At": "2025-01-07 09:31:22.701164101 UTC",
      "Updated At": "2025-01-07 09:31:22.701164895 UTC",
      "Active": true,
      "Allocation Amount": "120TiB",
      "Signers": []
    }
  ]
}